papers/note-web2.tex
% Created 2020-10-27 Tue 19:52
% Intended LaTeX compiler: xelatex
\documentclass[a4paper]{article}

\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage[pass]{geometry}
\usepackage{fontspec, xpatch, fullpage, float, xcolor, titling}
\usepackage[newfloat]{minted}
\usepackage{xepersian}\settextfont{XB Roya}\setlatintextfont{XB Roya}\setdigitfont{XB Yas}\setmonofont{Iosevka}
\xpretocmd{\verbatim}{\begin{LTR}}{}{} \xapptocmd{\endverbatim}{\end{LTR}}{}{} \xpretocmd{\minted}{\VerbatimEnvironment\begin{LTR}}{}{} \xapptocmd{\endminted}{\end{LTR}}{}{}
\author{محمدیاسین داوده}
\date{\today}
\title{گردآوری شماره ۲ مرتبط با درس وب}
\hypersetup{
 pdfauthor={محمدیاسین داوده},
 pdftitle={گردآوری شماره ۲ مرتبط با درس وب},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 27.1 (Org mode 9.4)}, 
 pdflang={Farsi}}
\begin{document}

\maketitle

\section{مقایسه \texttt{"} و \texttt{'}}
\label{sec:org3a0fd62}
\texttt{'} مقادیر را همانگونه که هستند چاپ می‌کند (به استثنای \texttt{\textbackslash{}'}).

\begin{minted}[linenos,mathescape]{php}
<?php
$num = "1";
$nums = "123";
print("$nums \n");
print("\"{$num}s \n");
print('$nums \n');
print('\'{$num}s \n');
\end{minted}

\begin{verbatim}
123 
"1s 
$nums \n'{$num}s \n
\end{verbatim}


\texttt{"} حروف خاص را قبول می‌کند و آنها را پردازش می‌کند. این حروف، \texttt{\textbackslash{}"} و \texttt{\$} و حروف رایج \texttt{\textbackslash{}n}, \texttt{\textbackslash{}t} و غیره هستند.
برای ایزوله کردن \texttt{\$} در چنین رشته‌هایی از \texttt{\{\}} استفاده می‌کنیم.

در مواقع خیلی خاص ممکن است \texttt{'} سریعتر از \texttt{"} باشد چرا که حروف خاص کمتری را قبول می‌کند.

\section{مقایسه \texttt{print} و \texttt{echo}}
\label{sec:orgae6434f}
\begin{enumerate}
\item \texttt{echo} مقدار بازگشتی ندارد در حالی که \texttt{print} مقدار \texttt{1} را برمی‌گرداند.
\item \texttt{echo} چند ورودی می‌پذیرد در حالی که دیگری اینطور نیست.
\item \texttt{echo} سریع‌تر است.
\end{enumerate}

\section{تفاوت زبان برنامه‌نویسی و اسکریپت‌نویسی}
\label{sec:org614d813}
زبان‌های اسکریپتی زبان‌هایی هستند که از اسکریپت‌ها پشتیبانی می‌کنند.
اسکریپت برنامه‌ای مخصوص محیطی خاص است که برای اتوماسیون وظایف دیگر برنامه‌ها یا انسان‌ها به کار می‌رود. این در حالی است که زبان‌های برنامه‌نویسی معمولاً برای محاسبهٔ خروجی‌ها یا محاسبات به کار می‌روند.

زبان‌های اسکریپتی معمولاً تفسیر می‌شوند و به همین دلیل
معمولاً کندتر هستند و مانند برنامه‌های ترجمه‌ای درجا تمام بررسی نمی‌شوند و ممکن است  میزبان خطاهای نهفتهٔ بیشتری باشند. همچنین این برنامه‌ها وابسته به مفسر هستند.
مزیت زبان‌های اسکریپتی تعامل بالای آنها با کاربر است.

\lr{C}, \lr{C++}, \lr{Java} و \lr{Pascal} برنامه‌نویسی و
\lr{JavaScript}, \lr{Ruby}, \lr{Shell}, \lr{Perl}, \lr{Php} و \lr{Python} اسکریپتی هستند.
\end{document}
